#include <stdio.h>
#include "idiom.h"
#include <stdlib.h>
#include <Windows.h>

void GotoSystemMenu()
{
	printf("******************************************\n");
	printf("欢迎进入\"成语大会\"游戏!!!!\n");
	printf("******************************************\n");
}

void MainMenu(char *user) // 游戏主菜单
{
	printf("***********欢迎用户：%s，一起玩成语吧！***********************\n", user);
	printf("1.我要猜成语\n");
	printf("2.我要补成语\n");
	printf("3.我要看排名\n");
	printf("4.退出游戏\n");
	printf("*************************************************************\n");
}

void GuessBeginMenu() // 猜成语界面
{
	printf("*********************一起猜成语********************************\n");
	printf("本游戏规则是系统展示一个成语解释，您猜其对应成语。\n");
	printf("**如果您猜对,则得5分。\n");
	printf("**如果您要继续游戏,请输入y，否则输入n\n");
	printf("***************************************************************\n");
}

void FillIdiomMenu() // 补充成语界面
{
	printf("*********************一起补充成语********************************\n");
	printf("本游戏规是系统随机抽取一个成语，再随机展示2个汉字，请您补充剩余2个汉字。\n");
	printf("**如果您补充正确,则得5分。\n");
	printf("**如果您要继续游戏,请输入y，否则输入n\n");
	printf("***************************************************************\n");
}
void ShowRanking() // 查排名
{
}
void FileException() // 文件读取异常处理
{
	printf("\n文件打开失败！请先尝试玩别的游戏！");
	Sleep(500);
	system("cls");
	OperateGameMenu(); // 返回上一级菜单。
}
